import "./App.css";

const BookDescription = (props) => {
  return (
    <div>
      <div className="card">
        <div className="imageCard">
          <img className="image" src={props.src} alt="book-img" />
          <button
            onClick={() =>
              props.onClick(`სათაური: ${props.name}-- ავტორი: ${props.author}`)
            }
          >
            წიგნის გადახედვა
          </button>
        </div>
        <div className="bookDescription">
          <h1>{props.name}</h1>
          <h3>{props.author}</h3>
          <p>
            თუ ადამიანები საკუთარი ძალისხმევით, მეცნიერებისა და ტექნოლოგიების
            წყალობით, პლანეტა დედამიწის ღმერთებად ვიქცევით, სამომავლო მიზნად
            რაღას დავისახავთ? როგორ დავიცავთ მყიფე მსოფლიოს ჩვენივე შექმნილი
            დამანგრეველი ძალებისგან? მკითხველის წინაშეა „ნიუ-იორკ ტაიმსის“
            ბესტსელერის, კრიტიკოსთა მიერ საერთაშორისო მოვლენად აღიარებული
            „საპიენსის“ ავტორის, იუვალ ნოახ ჰარარის ახალი, ორიგინალური და
            ცნობისმოყვარეობის აღმძვრელი წიგნი. ისტორიისა და თანამედროვე
            სამეცნიერო მიღწევების ანალიზის საფუძველზე ჰარარი კაცობრიობის
            განვითარების პერსპექტივებს განიხილავს და ვარაუდობს, რომ ადამიანთა
            „ღმერთებად გადაქცევა“ ჩვენი სამომავლო მისია იქნება. ავტორი, თხრობის
            თვითმყოფადი სტილით, საინტერესოდ გვიხსნის, როგორ და რატომ არის
            შესაძლებელი, ეს განზრახვა განხორციელდეს, ანდა რას შეიძლება ნიშნავდეს
            ადამიანის „ღმერთად ქცევა“. ჰარარი იმ პროექტებზე, ოცნებებსა თუ
            კოშმარებზე მსჯელობს, რომლებიც ოცდამეერთე საუკუნის მსოფლიოზე უდიდეს
            გავლენას მოახდენს – სიკვდილის ძლევით დაწყებული, ხელოვნური სიცოცხლის
            შექმნით დამთავრებული. ნუთუ ევოლუციის მომდევნო სავარაუდო ეტაპი ჰომო
            დეუსის ჩამოყალიბება იქნება? ავტორი სვამს ფუნდამენტურ კითხვას: რა
            გზას ავირჩევთ? ამჯერად იგი კაცობრიობის მომავლის სურათს გვიხატავს.
          </p>
        </div>
      </div>
    </div>
  );
};

export default BookDescription;
